studies/hyperion-development/benchmark.smoke.yaml
schema_version: "2"
id: hyperion-development-smoke
title: Hyperion development corpus plumbing smoke
dataset: ../../datasets/hyperion-development-v1/dataset.yaml
target:
  id: artemis-java-maven
  version: "1"
  revision: protocol-fixture-v1
  parameters:
    language: java
    build_system: maven
budget:
  wall_time_ms: 30000
  max_model_calls: 1
  max_tool_calls: 1
  max_input_tokens: 1000
  max_output_tokens: 1000
  max_total_tokens: 2000
  max_cost:
    amount: 0.01
    currency: USD
systems:
  - id: deterministic-mock
    name: Deterministic protocol fixture
    version: "1"
    revision: source-tree
    runtime:
      type: command
      command: ["{bun}", "run", "../../examples/mock-generator.ts"]
    factors:
      approach: fixture
      model: none
      provider: fixture
    parameters: {}
    attestation:
      deployment_deviations: []
trials:
  replicates: 1
  base_seed: 497506175
analysis:
  method: case_clustered_bootstrap
  estimand: end_to_end_within_budget_strict_success_rate
  bootstrap_seed: 2946802029
  bootstrap_resamples: 500
  confidence_level: 0.95
  contrasts: []
execution:
  results_dir: ../../.exgen/runs
  concurrency: 4
  max_log_bytes: 1048576
extensions:
  designation: development_smoke